In [91]:
# !pip install psycopg2
# !pip install sqlalchemy

In [92]:
import pandas as pd
import os
import psycopg2
from dotenv import load_dotenv
from sqlalchemy import create_engine

In [93]:
load_dotenv()
# Get the postgres connection information from os file.
# DB_HOST = os.getenv('DB_HOST')
DB_HOST = 'localhost'
DB_NAME = os.getenv('DB_NAME')
# DB_USER = os.getenv('DB_USER')
DB_USER = 'postgres'
DB_PASS = os.getenv('DB_PASS')

In [94]:
print(DB_HOST)

localhost

In [95]:
engine = create_engine(f'postgresql://{DB_USER}:{DB_PASS}@{DB_HOST}/{DB_NAME}')

In [96]:
# conn = psycopg2.connect(dbname=DB_NAME, user = DB_USER,
#     password = DB_PASS, host = DB_HOST)

In [97]:
departments_df = pd.read_csv('Inputs/departments.csv')
dept_df = pd.read_csv('Inputs/dept_emp.csv')
dept_manager_df = pd.read_csv('Inputs/dept_manager.csv')
employees_df = pd.read_csv('Inputs/employees.csv')
salaries_df = pd.read_csv('Inputs/salaries.csv')
titles_df = pd.read_csv('Inputs/titles.csv')

In [98]:
departments_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [99]:
dept_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [100]:
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [101]:
employees_df['birth_date'] = pd.to_datetime(employees_df.birth_date)
employees_df['hire_date'] = pd.to_datetime(employees_df.hire_date)
# employees_df.hire_date.dtype
employees_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [102]:
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [103]:
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [104]:
# load df to database
departments_df.to_sql('departments',engine,index=False,if_exists='replace')
dept_df.to_sql('dept_emp',engine,index=False,if_exists='replace')
dept_manager_df.to_sql('dept_manager',engine,index=False,if_exists='replace')
employees_df.to_sql('employees',engine,index=False,if_exists='replace')
salaries_df.to_sql('salaries',engine,index=False,if_exists='replace')
titles_df.to_sql('titles',engine,index=False,if_exists='replace')

In [110]:

# write python program to connect to postgres and load data to postgre database
#
# conda install psycopg2 - PostgresSQL database adapter for Python
#
#
#
# 
#

import pandas as pd
import os
import psycopg2
from dotenv import load_dotenv
from sqlalchemy import create_engine

load_dotenv()
# Get the postgres connection information from os file.
# DB_HOST = os.getenv('DB_HOST')
DB_HOST = 'localhost'
DB_NAME = os.getenv('DB_NAME')
# DB_USER = os.getenv('DB_USER')
DB_USER = 'postgres'
DB_PASS = os.getenv('DB_PASS')

# print(DB_PASS)

departments_df = pd.read_csv('Inputs/departments.csv')
dept_df = pd.read_csv('Inputs/dept_emp.csv')
dept_manager_df = pd.read_csv('Inputs/dept_manager.csv')
employees_df = pd.read_csv('Inputs/employees.csv')
salaries_df = pd.read_csv('Inputs/salaries.csv')
titles_df = pd.read_csv('Inputs/titles.csv')


# # sqlachemy

engine = create_engine(f'postgresql://{DB_USER}:{DB_PASS}@{DB_HOST}:5432/{DB_NAME}')

# # load df to database
departments_df.to_sql('departments',engine,index=False,if_exists='append')
print('departments')
dept_df.to_sql('dept_emp',engine,index=False,if_exists='append')
print('dept_emp')
dept_manager_df.to_sql('dept_manager',engine,index=False,if_exists='append')
print('dept_manager')
employees_df.to_sql('employees',engine,index=False,if_exists='append')
print('employees')
salaries_df.to_sql('salaries',engine,index=False,if_exists='append')
print('salaries')
titles_df.to_sql('titles',engine,index=False,if_exists='append')
print('titles')
dept_df.to_sql('dept_emp',engine,index=False,if_exists='append')
print('dept_emp')

# sql_challenge.py
# Displaying sql_challenge.py.

departments
dept_emp
dept_manager
employees
salaries
tities
dept_emp